print('Name')

print('Розрахунок суми n-перших членів арифметичної прогресії')
n1 = float(input('Задайте номер одного з членів:'))
zn1 = float(input('Задайте значення одного з членів:'))
n2 = float(input('Задайте номер іншого з членів:'))
zn2 = float(input('Задайте значення іншого з членів:'))
n = float(input('Задайте n:'))

if n1 > 0 and n2 > 0 and n > 0:
    d= (zn1 - zn2)/(n1 - n2)
    print('Різниця дорівнює: ', d)
    a1=zn2-d*(n2-1)
    print('Перший член прогресії дорівнює: ', a1)
    s=(2*a1+d*(n-1))*n/2
    print('Сума n-перших членів арифметичної прогресії дорівнює : ', s)
else:
    print('Помилка введених даних. Номери членів мають бути додатніми.')
