#include<iostream>
#include<windows.h>
#include<string>
#include"isNumber.h"

using namespace std;

string Processing(string, char); // Прототип функції, що замінює цифри у рядку символом

int main()
{
	//===============Відображення українських літер у консолі===============
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	//===============Виведення даних про лабораторну роботу=================
	cout << "\n\n\n";
	cout << " Лабораторна робота №9 / Варіант 35 / ІС-03 / Філоненко Андрій\n";
	cout << "\n\n\n";
	//===============Змінні рядку та символу-замінника цифер================
	string a;
	char rechar;
	//=============================Введення=================================
	cout << " Введіть, будь-ласка, свій рядок : ";
	getline(cin, a);
	cout << " Введіть, будь-ласка, символ-замінник : ";
	cin >> rechar;
	cin.ignore(32767, '\n'); // Ігнорування усіх символів, окрім першого
	cout << "\n\n\n";
	system("CLS"); // Очистка консолі
	//=======================Заміна цифер на rechar=========================
	cout << "\n==========\n\n";
	cout << " Рядок  : " << a << endl;
	cout << " Символ : " << rechar << endl;
	a = Processing(a, rechar); // Заміна цифер у рядку на обраний символ
	cout << "\n==========\n\n";
	//=======================Виведення результату===========================
	cout << " Результат перетворень : \n " << a << endl;
	cout << "\n==========\n\n";
	//======================================================================
}
string Processing(string a, char replace)
{
	int counter = 0;
	for (int i = 0; i < a.size(); i++)
	{
		if (isNumber(a[i]))
		{
			a[i] = replace;
			counter++;
		}
	}
	if (counter)
	{
		cout << " Кількість цифер у рядку : " << counter << ". Замінюю їх на " << replace << endl;
	}
	else
	{
		cout << " Цифер не виявлено.\n";
	}
	return a;
}